;-------------------------
; 再帰
;-------------------------
(define (f n)
  (if (< n 3)
    n
    (+ (+ (f (- n 1)) (* 2 (f (- n 2))) (* 3 (f (- n 3)))))))

; (f 3) = 4
; (f 4) = 11
; (f 5) = 25

;-------------------------
; 反復
;-------------------------
(define (f n)
  (if (< n 3)
    n
    (f-iter 2 1 0 n)))

(define (f-iter a b c count)
  (if (< count 3)
    a
    (f-iter (+ a (* 2 b) (* 3 c))
            a
            b
            (- count 1))))

; 以下のように展開する
; (f 3)
; (f-iter 2 1 0 3)
; (f-iter 4 2 1 2)
; 4

; (f 4)
; (f-iter 2 1 0 4)
; (f-iter 4 2 1 3)
; (f-iter 11 2 1 2)
; 11

; (f 5)
; (f-iter 2 1 0 5)
; (f-iter 4 2 1 4)
; (f-iter 11 2 1 3)
; (f-iter 25 2 1 2)
; 25
